alefragnani.project-manager
alibaba-cloud.tongyi-lingma
amiralizadeh9480.laravel-extra-intellisense
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
bmewburn.vscode-intelephense-client
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
docker.docker
donjayamanne.githistory
emilast.logfilehighlighter
fill-labs.dependi
formulahendry.code-runner
galkowskit.go-interface-annotations
golang.go
gruntfuggly.todo-tree
irongeek.vscode-env
kylinideteam.gitlens
liuchao.go-struct-tag
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-kubernetes-tools.vscode-kubernetes-tools
ms-pyright.pyright
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
openai.chatgpt
pomdtr.excalidraw-editor
redhat.vscode-yaml
rooveterinaryinc.roo-cline
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
sst-dev.opencode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tooltitudeteam.tooltitude
tooltitudeteam.tooltitude-py
usernamehw.errorlens
vadimcn.vscode-lldb
vue.volar
wanniwa.editorjumper
