alefragnani.project-manager
alibaba-cloud.tongyi-lingma
anthropic.claude-code
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
codeium.windsurfpyright
docker.docker
donjayamanne.githistory
emilast.logfilehighlighter
fill-labs.dependi
formulahendry.code-runner
galkowskit.go-interface-annotations
golang.go
gruntfuggly.todo-tree
irongeek.vscode-env
kylinideteam.gitlens
liuchao.go-struct-tag
mechatroner.rainbow-csv
mhutchie.git-graph
michaelzhou.fleet-theme
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
njpwerner.autodocstring
pkief.material-icon-theme
redhat.vscode-yaml
ricardoerikson.vscode-go-impl-methods
rust-lang.rust-analyzer
sst-dev.opencode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tooltitudeteam.tooltitude
usernamehw.errorlens
vadimcn.vscode-lldb
vue.volar
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
